tap "homebrew/bundle"

# Currently installed individually via install.sh
brew "gh"
brew "neovim"
brew "bat"
brew "eza"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "zoxide"

# Additional recommended tools
brew "jq"
brew "yq"
brew "git-delta"
brew "lazygit"
brew "btop"
brew "dust"
brew "duf"

# macOS apps
cask "rectangle"  # Window management (free, keyboard-driven split)
cask "raycast"    # Spotlight replacement (free)
