# Shell essentials
brew "gh"
brew "starship"   # Cross-shell prompt (replaces oh-my-zsh theme)

# Editor
brew "neovim"

# Modern CLI replacements
brew "bat"        # cat with syntax highlighting
brew "eza"        # ls replacement
brew "fzf"        # Fuzzy finder
brew "fd"         # find replacement
brew "ripgrep"    # grep replacement
brew "zoxide"     # cd replacement

# Git tooling
brew "git-delta"  # diff pager
brew "lazygit"    # TUI git client

# Data tools
brew "jq"
brew "yq"

# System monitoring
brew "btop"       # top replacement
brew "dust"       # du replacement
brew "duf"        # df replacement

# macOS apps
cask "rectangle"  # Window management (free, keyboard-driven split)
cask "raycast"    # Spotlight replacement (free)
