{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "CreationDate": "2026-04-10T00:00:00.000-00:00",
  "Sources": [
    {
      "Packages": [
        { "PackageIdentifier": "GitHub.cli" },
        { "PackageIdentifier": "Starship.Starship" },
        { "PackageIdentifier": "Neovim.Neovim" },
        { "PackageIdentifier": "sharkdp.bat" },
        { "PackageIdentifier": "eza-community.eza" },
        { "PackageIdentifier": "junegunn.fzf" },
        { "PackageIdentifier": "sharkdp.fd" },
        { "PackageIdentifier": "BurntSushi.ripgrep.msvc" },
        { "PackageIdentifier": "ajeetdsouza.zoxide" },
        { "PackageIdentifier": "jqlang.jq" },
        { "PackageIdentifier": "mikefarah.yq" },
        { "PackageIdentifier": "jesseduffield.lazygit" },
        { "PackageIdentifier": "dandavison.delta" },
        { "PackageIdentifier": "Schniz.fnm" },
        { "PackageIdentifier": "astral-sh.uv" }
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    }
  ],
  "WinGetVersion": "1.0.0"
}
